app/controllers/todo_items_controller.rb

  def index
    @todo_items = TodoItem.all
---
SELECT "todo_items".* FROM "todo_items"

  def create
    @todo_item = TodoItem.new(todo_item_params)

    respond_to do |format|
      if @todo_item.save
---
INSERT INTO "todo_items" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Call Shaul"], ["created_at", "2018-11-14 13:34:09.207332"], ["updated_at", "2018-11-14 13:34:09.207332"]]

  def destroy
    @todo_item.destroy
---
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 2]]

    def set_todo_item
      @todo_item = TodoItem.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]